{
  "posts": [
    {
      "authors": [
        {
          "id": "clks3j2gw0rln0bphhtn40w0w",
          "name": "Taliya Don",
          "bio": "A girl who vowed her life to penning otherworldly realms",
          "photo": {
            "url": "https://media.graphassets.com/pTkg3o6RTSanfMEZ0MSb"
          }
        }
      ],
      "title": "#1 Hidden Night (Desdemona’s Foster Home For Youngsters)",
      "slug": "1-hidden-night-desdemona-s-foster-home-for-youngsters",
      "content": {
        "html": "<h1><strong>CHAPTER 1</strong></h1><p><br>Raindrops started pelting the window panel with such force that I briefly worried that the casement would rip in two. Slowly reaching for the window, I fondled the moisture that started to drip down like ice crystals with my shell-pink, down-soft fingers. I couldn&#39;t dial down the excitement to experience the true sensation of rain on my flimsy, trembling hands, so I slowly opened the window of the train I was riding on and nonchalantly spread my bare hands outside. The moment the raindrops began to land on my face, the joie de vivre that had been buried within me and gone spiritless was instantly rejuvenated. Droplets of ecstasy began to dance within me as they touched my parched lips and, as dry as a desert face.</p><p><br><strong>&quot;Martha... quit clowning around and try to be a tad serious.&quot; </strong>Ms. Paisley, who looks after me and has an absurdly large bust hanging, yelled.</p><p>An older gentleman was staring at her with apparent glee, which I started to notice. I looked into Paisley&#39;s eyes, which were dampened with melancholy. She was born with a cleft lip and palate, but the trauma didn&#39;t make her any less beautiful. &quot;<strong>That was a mistake on my part, Ms. Paisley. My apologies.&quot;  </strong>I responded in the most polite manner I knew how sounding more sorry than ever. That incident literally left me with an egg on my face. I didn&#39;t realize how resonating and powerful idioms could sound until then. I pretty much lost the courage and resilience I had been building up.</p><p><br>Traveling for hours when it&#39;s arctic outside is literally no picnic. I slowly exhaled a lungful of air into my palms and began to rub my mitten-clad hands together. I could feel a lump inside my sweater pockets. My hands started to dig around inside and eventually came up with a 1930 Shiseido orange-tinted lipstick. I took off the cap and started slathering it on as thickly as I could.</p><p><br><strong>&quot;How enthusiastic are you about the new foster home?&quot; </strong>Ms. Paisley questioned while stumbling a little bit to lower the window sash so that raindrops wouldn&#39;t fall inside. The old geezer&#39;s peepers widened as her midriff started to protrude more and more. </p><p><strong>&quot;Err... Um...</strong><em><strong>Waiting with bated breath</strong></em><strong>!&quot; </strong>I responded while simultaneously attempting to plug in my earphones so I could jam to my favorite playlist.  Just like how vinegar helps you dispel the effects of alcohol, a new place or step is necessary for me to sleep off the effects of this humdrum life devoid of thrills and jam. I had never before desired to tear up the miles more than I did at this moment. I was being raised by Mrs. and Mr. Wyatt just over a year ago when I left another orphanage home in a body. Despite their good intentions, they find themselves unable to support me any longer, so here I am,  forced to travel without knowing what will become of me.</p><p>There was simply black ice on the roads we walked on. I didn&#39;t foresee the cold snap that was awaiting on the other side of the planet. I made a slow, zigzag motion down the snow-covered street, leaving enormous footprints all over the place. The imprints of a future still unknown </p><p>Ms. Paisley stopped dead in her tracks. She gave me a direct stare and a tighter hug as if I were a squishy marshmallow she could use now and then to let out her feelings.<strong> &quot;You were so kind to us, and how we wish we could have had you with us as our daughter. I am so sorry. We need to let go of you at this time. We&#39;ll miss you a lot. &quot;</strong> She spoke between her feeble sobs.</p><p><br>I wanted to let her know that joy is a fleeting emotion that comes and goes. I wanted to tell them how grateful I was and how much I loved them because it was with them that I had some of my best days. Six Ways to Sunday, they made my life joyful.  Mr. Waytt was, of course, a good foster father, and Ms. Paisley, needless to say, is somebody who made sure I got the best of both worlds. But it seemed as though I was at a loss for words. Although words were literally shoving their way out of my mouth, I lacked the energy to voice them out. I responded with a smile, a smile worth a billion words. She planted the most tender kiss on my forehead. Her lips were trembling inexplicably, just like the leaves on trees when the wind picks up.</p><p><br>—-------------------------------------------------------------------</p><p><br>The foster home had the same appearance as one straight out of Amityville. While slowly removing the snow from my winter coat, I took a thorough look inside. The fire inside the fireplace was blazing hot. While some students worked to assist the new students in unloading their luggage, others hunkered down near the fireplace in an effort to warm up. I stood there, scared shitless, lugging two large bags. Everyone else was shooting their mouths off, while I looked like a sick daughter who had just shaken off an illness.  I whirled around to make sure that at least these kids here looked like humans, not so that my eyes would erroneously fall on any handsome boys. Nevertheless, in an unanticipated flash, I happened to notice a mass of handsome lads. One of them caught my attention, and I quickly tried to cover it up by blinking as if a speck of dust had flown into my hazel eyes.</p><p></p><p><em><strong>&quot;Martha Maertisa Dakota,&quot; </strong></em>a voice called out. I was startled to see a woman dressed in a white gown the moment I turned around. She looked at me as though I were an extraterrestrial life dropped off from space. Giving people the heebie-jeebies and being easily frightened seem to be in my genetic makeup. </p><p><strong>&quot;That&#39;s me !&quot; </strong>I spoke up.</p><p><br><em><strong>Strange! </strong></em>She gave me a quick once-over before saying this.</p><p><br><strong>&quot;My name is Penelope. I am your guardian here. &quot; &quot;Greetings from Desdemona&#39;s Foster Home for Youngsters,&quot; </strong>she said and made the sweetest smile she could muster.</p><p><br><br>(<em>To be continued</em>)</p><p></p>"
      },
      "connections": [
        {
          "id": "clkwncm8i0qiz0bo5qstbkr22",
          "name": "Desdemona’s Foster Home For Youngsters",
          "post": [
            {
              "id": "clkwncybd0qjs0bo5sne1keit",
              "slug": "1-hidden-night-desdemona-s-foster-home-for-youngsters",
              "title": "#1 Hidden Night (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"In a world where Martha navigates a life of constant change and fleeting joys, little does she know that the arrival at Desdemona's Foster Home will unveil secrets that link her past to a destiny she never imagined. As Penelope's smile conceals more than meets the eye, Martha's journey is about to take a mysterious turn she could never have foreseen.\""
            },
            {
              "id": "clkwnrxyl08j80bpmjvva6hdz",
              "slug": "2-santiago-desdemona-s-foster-home-for-youngsters",
              "title": "#2 Santiago (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\n\"Amidst the enchanting mysteries of Desdemona's Foster Home, Martha finds herself entangled in a web of unexpected encounters and emotions. As Santiago's piercing gaze leaves her with a mix of infatuation and fear, little does she know that their lives are about to collide in ways she could never have imagined.\""
            },
            {
              "id": "clkwo9kq208px0bpm9qn2j60h",
              "slug": "3-reality-reeks-desdemona-s-foster-home-for-youngsters",
              "title": "#3 Reality Reeks (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"As Martha's heart raced and her palms grew clammy, she couldn't shake the feeling that she was about to uncover a dark secret that would change everything she thought she knew about herself and the academy. Little did she know, the truth lurking in the shadows would shatter her world in ways she could never have imagined.\""
            },
            {
              "id": "clkwole9s0r7y0bo5739cf9ct",
              "slug": "4-the-beginning-desdemona-s-foster-home-for-youngsters",
              "title": "#4 The Beginning (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"As Martha delves deeper into the secrets of the academy and forms an unexpected alliance with Emory, she begins to uncover the truth behind the mysterious group FOUR. Little does she know that her journey into the world of witches, mysteries, and danger has only just begun, and the answers she seeks might shatter her reality forever.\""
            },
            {
              "id": "clkwp7c6m0rhd0bo57q5j6mu8",
              "slug": "5-dawn-of-love-desdemona-s-foster-home-for-youngsters",
              "title": "#5 Dawn Of Love (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"As Martha's heart sinks with humiliation, she is determined to prove herself in the culinary class. But as the mysterious Fortunate Four continue to taunt her, she starts unraveling the hidden connections between them, the academy, and her own past, plunging her into a web of secrets she never imagined. The answers lie in the enigmatic world of Crescentchests, but will Martha be ready to face the truth that awaits her?\"\n\n"
            },
            {
              "id": "clkwpo8ry09dc0bpmc5002bny",
              "slug": "6-a-wraith-of-curse-desdemona-s-foster-home-for-youngsters",
              "title": "#6 A Wraith Of Curse (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"As Martha and Tad share a stolen moment in the rain, unexpected emotions surface, and they find an unexpected connection amidst the chaos of their world. But little do they know that this newfound bond will lead them down a rabbit hole of secrets, conspiracies, and dangerous alliances, threatening to unravel everything they thought they knew about their seemingly simple life\""
            },
            {
              "id": "clkwq30we09jg0bpmfz9ewrxq",
              "slug": "7-a-rude-awakening-desdemona-s-foster-home-for-youngsters",
              "title": "#7 A Rude Awakening (Desdemona’s Foster Home For Youngsters)",
              "excerot": "\"As the mysterious Santiago steps in to save Martha from Tad's sinister grasp, a web of secrets and darkness begins to unravel. Little does Martha know that Santiago's actions are just the beginning of a twisted game that will push her to the brink of her sanity, where the line between reality and nightmare blurs, and the true face of evil is revealed.\""
            }
          ]
        }
      ]
    }
  ]
}
